Revit 2027 API
StairsRun.ActualTreadsNumber Property
 The actual number of stairs treads in the stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ActualTreadsNumber { get; }
Public ReadOnly Property ActualTreadsNumber As Integer
	Get
public:
property int ActualTreadsNumber {
	int get ();
}
member ActualTreadsNumber : int with get
Property Value
Int32
Remarks
 This is a read-only value.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace